export const hiraDict = {
        'vHira' : ['あ','い','う','え','お'], 'kHira' : ['か','き','く','け','こ'], 'sHira' : ['さ','し','す','せ','そ'],
        'tHira' : ['た','ち','つ','て','と'], 'nHira' : ['な','に','ぬ','ね','の','ん'], 'hHira' : ['は','ひ','ふ','へ','ほ'],
        'mHira' : ['ま','み','む','め','も'], 'yHira' : ['や','ゆ','よ'], 'rHira' : ['ら','り','る','れ','ろ'], 
        'wHira' : ['わ','を'], 
        'dHira' : ['が','ぎ','ぐ','げ','ご', 'ざ','じ','ず','ぜ','ぞ','だ','ぢ','づ','で','ど','ば','び','ぶ','べ','ぼ','ぱ','ぴ','ぷ','ぺ','ぽ'
        ]
    }

export const romajiToHira = {
    'wo':'を','wa':'わ',
    'ro':'ろ','re':'れ','ru':'る','ri':'り','ra':'ら',
    'yo':'よ','yu':'ゆ','ya':'や',
    'mo':'も','me':'め','mu':'む','mi':'み','ma':'ま',
    'ho':'ほ','he':'へ','fu':'ふ','hi':'ひ','ha':'は',
    'no':'の','ne':'ね','nu':'ぬ','ni':'に','na':'な',
    'to':'と','te':'て','tsu':'つ','chi':'ち','ta':'た',
    'so':'そ','se':'せ','su':'す','shi':'し','sa':'さ',
    'ko':'こ','ke':'け','ku':'く','ki':'き','ka':'か',
    'n':'ん','o':'お','e':'え','u':'う','i':'い','a':'あ'
}

export const hiraToRomaji = {
    'あ':'a','い':'i','う':'u','え':'e','お':'o','ん':'n',
    'か':'ka','き':'ki','く':'ku','け':'ke','こ':'ko',
    'さ':'sa','し':'shi','す':'su','せ':'se','そ':'so',
    'た':'ta','ち':'chi','つ':'tsu','て':'te','と':'to',
    'な':'na','に':'ni','ぬ':'nu','ね':'ne','の':'no',
    'は':'ha','ひ':'hi','ふ':'fu','へ':'he','ほ':'ho',
    'ま':'ma','み':'mi','む':'mu','め':'me','も':'mo',
    'や':'ya','ゆ':'yu','よ':'yo',
    'ら':'ra','り':'ri','る':'ru','れ':'re','ろ':'ro',
    'わ':'wa','を':'wo',
    'が':'ga','ぎ':'gi','ぐ':'gu','げ':'ge','ご':'go',
    'ざ':'za','じ':'ji','ず':'zu','ぜ':'ze','ぞ':'zo',
    'だ':'da','ぢ':'di','づ':'du','で':'de','ど':'do',
    'ば':'ba','び':'bi','ぶ':'bu','べ':'be','ぼ':'bo',
    'ぱ':'pa','ぴ':'pi','ぷ':'pu','ぺ':'pe','ぽ':'po',
}
